// 固化分组
// 量词匹配成功了, 量词之前就丢失状态, 不回溯
// 量词匹配失败了, 回溯到量词之前的状态


// /(\.\d\d[1-9]?)\d*/ 可以达到要求
// 0.6255 => 0.625 是替换
// 0.625 => 0.625  这里也是替换, 但是希望匹配失败, 不替换, 效果也是一样的

// 0.625 or 0.500

const regexp1 = /(\.\d\d[1-9]?)\d+/;


// 0.62 [1-9] 匹配成功后, \d 无法匹配, 回溯到 [1-9]? 一个状态, 让出了 5
console.log('0.625'.replace(regexp1, '$1'));
console.log('0.500'.replace(regexp1, '$1'));


// 固化分组
// (?>)
// const regexp2 = /(\.\d\d(?>[1-9]?)\d)/;

// 占有优先
// ?+  *+ ++ {m,n}+
// const regexp2 = /(\.\d\d[1-9]?+\d)/;
// console.log('0.625'.replace(regexp2, '$1'));
// console.log('0.500'.replace(regexp2, '$1'));

// 固化分组和占有优先 js 都不支持